taurus-101/scripts/website-test.yml
modules:
  jmeter:
    path: /jmeter
    version: 5.2.1
    plugins:
    - jmeter.backendlistener.azure

execution:
- scenario: website-test
  concurrency: 5
  hold-for: 10s
  ramp-up: 2s

# Generate HTML report, see https://stackoverflow.com/questions/51955998
services:
- module: shellexec
  post-process:
  - >
    cd ${TAURUS_ARTIFACTS_DIR}
    && rm -rf report
    && cp kpi.jtl kpi.csv
    && /jmeter/bin/jmeter -Jjmeter.save.saveservice.assertion_results_failure_message=false -g kpi.csv -o report -q jmeter-bzt.properties

scenarios:
  website-test:
    script: website-test.jmx

reporting:
- module: junit-xml
  filename: /tmp/artifacts/jmeter.xml